app/Http/Controllers/Auth/RegisterController.php

    protected function create(array $data)
    {
        return User::create([
            'name' => $data['name'],
            'email' => $data['email'],
            'password' => Hash::make($data['password']),
            'balance' => 5000,
        ]);
---
insert into `users` (`name`, `email`, `password`, `balance`, `updated_at`, `created_at`) values ('Test', 'testuser1@gmail.com', '$2y$10$Gr6VPxTglm41TIzSTQRBOO9dTLsMMVyCX..z6h7dzPhqZmGZpXfee', 5000, '2023-12-21 22:40:32', '2023-12-21 22:40:32')