app/Http/Controllers/CartController.php

    public function purchase(Request $request)
    {
        $productsInSession = $request->session()->get("products");
        if ($productsInSession) {
            $userId = Auth::id();
            $order = new Order();
            $order->user_id = $userId;
            $order->total = 0;
            $order->save();

            $total = 0;
            $productsInCart = Product::findMany(array_keys($productsInSession));
            foreach ($productsInCart as $product) {
                $quantity = $productsInSession[$product->id];
                $item = new Item();
                $item->quantity = $quantity;
                $item->price = $product->price;
                $item->product_id = $product->id;
                $item->order_id = $order->id;
                $item->save();
                $total = $total + ($product->price * $quantity);
            }
            $order->total = $total;
            $order->save();

            $newBalance = Auth::user()->balance - $total;
            Auth::user()->balance = $newBalance;
            Auth::user()->save();
---
insert into `orders` (`user_id`, `total`, `updated_at`, `created_At`) values (42, 0, '2023-12-21 22:41:03', '2023-12-21 22:41:03')
insert into `items` (`quantity`, `price`, `product_id`, `order_id`, `updated_at`, `created_at`) values ('1', 5501, 2, 1, '2023-12-21 22:41:03', '2023-12-21 22:41:03')
update `users` set `balance` = -2826, `users`.`updated_at` = '2023-12-21 22:41:03' where `id` = 42