app/Http/Controllers/ProductController.php

select * from `products`
---
    public function index()
    {
        $viewData = [];
        $viewData['title'] = "Products - Just Another Online Store";
        $viewData['subtitle'] = "List of products";
        $viewData['products'] = Product::all();

select * from `products` where `products`.`id` = '1' limit 1
---
    public function show($id) {

        $viewData = [];
        $product = Product::findOrFail($id);