app/Http/Controllers/Admin/AdminProductController.php

    public function index()
    {
        $viewData = [];
        $viewData["title"] = "Admin Page - Products - Online Store";
        $viewData["products"] = Product::all();
---
select * from `products`

    public function edit($id)
    {
        $viewData = [];
        $viewData["title"] = "Admin Page - Edit Product - Online Store";
        $viewData["product"] = Product::findOrFail($id);
---
select * from `products` where `products`.`id` = '1' limit 1

    public function update(Request $request, $id)
    {

        // validation
        Product::validate($request);

        $product = Product::findOrFail($id);
        $product->setName($request->input('name'));
        $product->setDescription($request->input('description'));
        $product->setPrice($request->input('price'));

        if ($request->hasFile('image')) {
            $imageName = $product->getId().".".$request->file('image')->extension();
            Storage::disk('public')->put(
                $imageName,
                file_get_contents($request->file('image')->getRealPath())
            );
            $product->setImage($imageName);
        }

        $product->save();
---
select * from `products` where `products`.`id` = '1' limit 1
update `products` set `name` = 'REM', `image` = '1.png', `products`.`updated_at` = '2023-12-21 22:44:09' where `id` = 1